{"intents": [
    {"tag": "A",
    "patterns": ["Hallo",
                 "Hai",
                 "Hey",
                 "Hei",
                 "Halo",
                 "Selamat pagi",
                 "Selamat siang",
                 "Selamat sore",
                 "Selamat malam",
                 "Hola",
                 "Hello",
                 "Yuhu",
                 "Permisi",
                 "Assalamualaikum",
                 "Alo",
                 "Ada orang?",
                 "Heyo"],
    "responses": ["Hai! Ada yang bisa dibantu?",
                  "Hello! Ada yang bisa dibantu",
                  "Ada yang bisa saya dibantu?",
                  "Selamat datang di aplikasi donor darah",
                  "Bagaimana saya bisa membantu Anda?",
                  "Hello! Kami siap membantu Anda!"]
    },
    {"tag": "B",
    "patterns" : ["prosedur donor darah",
                  "bagaimana cara donor darah?",
                  "donor darah",
                  "cara donor darah",
                  "prosedur donor darah",
                  "langkah-langkah donor darah",
                  "tahapan donor darah",
                  "proses donor darah"],
    "responses": ["Tahap Registrasi : Mengisi formulir pendaftaran dan kuisioner kesehatan \n| Tahap Pemeriksaan Pendahuluan : Pengukuran berat badan, Pemeriksaan kadar haemoglobin darah, Pemeriksaan golongan darah bagi pendonor pemula \n| Tahap Pemeriksaan Kesehatan oleh Dokter : Anamnesis, Pemeriksaan tekanan darah, Pemeriksaan fisik sederhana \n| Tahap Pengambilan Darah Donor : Cuci lengan donor, Pengambilan darah, Pengambilan sampel darah \n| Tahap Administrasi : Mengambil kartu donor dan vitamin \n| Tahap Pemulihan : Pendonor dianjurkan untuk istirahat dan menikmati hidangan ringan yang kami sajikan"]
    },
    {"tag": "C",
    "patterns" : ["prosedur permintaan darah",
                  "bagaimana cara minta darah",
                  "minta darah",
                  "cara minta darah",
                  "prosedur permintaan darah",
                  "langkah-langkah minta darah",
                  "cara dapat darah",
                  "Saya membutuhkan darah",
                  "Apa syarat meminta darah?",
                  "Saya butuh darah",
                  "Saya butuh darah segera",
                  "Teman saya butuh darah",
                  "Keluarga saya butuh darah",
                  "Apakah saya bisa mendapatkan darah?"
                  ],
    "responses": ["Ketahui terlebih dahulu golongan darah. \nJika belum mengetahui golongan darah dapat melakukan pengecekan di PMI maupun di beberapa tempat berobat. \nMeminta surat keterangan dokter untuk dapat menjadi pengantar kebutuhan permintaan darah ke PMI. \nSerahkan surat keterangan pengantar permintaan darah kepada PMI dan nanti akan diberikan darah sesuai kebutuhan. \nMelakukan transaksi pembayaran untuk pengambilan darah. \n biaya per kantong darah dikenakan sebesar Rp 350.000."]
    },
    {"tag": "D",
    "patterns" : ["Apakah dengan donor darah dapat menyehatkan?",
                  "Apa efek samping donor darah?",
                  "Apa khasiat donor darah?",
                  "Manfaat donor darah",
                  "Apa manfaat donor darah?"],
    "responses": ["Bila seseorang mendonorkan darahnya, tubuhnya akan menggantikan volume darah dalam waktu 48 jam setelah donor, dan semua sel darah merah yang hilang akan benar-benar diganti dalam waktu empat sampai delapan minggu dengan sel-sel darah merah yang baru. \nProses pembentukan sel-sel darah merah yang baru akan membantu tubuh tetap sehat dan bekerja lebih efisien dan produktif."]
    },
    {"tag": "E",
    "patterns" : ["Mengapa harus donor darah?",
                  "Pentingnya donor darah"],
    "responses":["Donor darah penting karena Donor darah adalah kegiatan yang positif dan mulia dan kita bisa menolong sesama. Donor darah bisa membantu mereka yang membutuhkan darah dalam situasi mendesak. Karena seringkali saat pasien dalam kondisi kritis, pihak PMI atau rumah sakit tak memiliki stok darah yang cukup. Nyatanya, donor darah tak hanya bermanfaat bagi penerima (resipien) saja, namun pendonor juga menerima manfaat yang luar biasa. Banyak penelitian yang berhasil membuktikan secara medis bahwa mendonorkan darah sebenarnya menguntungkan"]
    },
    {"tag": "F",
    "patterns": ["Apa syarat-syarat untuk mendonorkan darah?",
                 "Syarat donor darah",
                 "Kriteria donor darah",
                 "Syarat pendonor",
                 "Apa saya boleh donor darah?"],
    "responses": ["Berikut merupakan syarat pendonor : Sehat jasmani dan rohani; \nTelah berumur 17 tahun ke atas; Berat badan minimal 45 Kg; \nTekanan darah normal (Sistole 90 - 160 dan Diastole 60 - 100); \nNadi 60-100x/menit; Kadar haemoglobin 12,5-17,0 gr/dL;\nTelah sarapan/makan sebelum pengambilan darah; \nTidak sedang mengkonsumsi obat selama 5 hari terakhir; \nTidak sedang haid/hamil/menyusui; \nTidak mengkonsumsi alkohol/narkotika; \nDemi keamanan dan keselamatan pendonor sesuai dengan PERMENKES 91 Tahun 2015 interval waktu sejak donor darah terakhir minimal 2 bulan; \nMembawa kartu identitas (KTP/SIM/Kartu Pelajar)"]
    },
    {"tag": "G",
    "patterns": ["Jangan menyumbangkan darah jika?",
                 "Kapan saat tidak boleh mendonor darah?"],
    "responses": ["Mempunyai penyakit jantung dan paru; menderita kanker; \nmenderita tekanan darah tinggi (hipertensi); \nmenderita kencing manis (diabetes militus); \nmemiliki kecenderungan perdarahan abnormal atau kelainan darah lainnya; \nmenderita epilepsi dan sering kejang; \nmenderita atau pernah menderita hepatitis B atau C; mengidap sifilis; \nketergantungan narkoba; \nkecanduan minuman beralkohol; \nmengidap atau beresiko tinggi terhadap HIV/AIDS; \ndokter menyarankan untuk tidak menyubangkan darah karena alasan kesehatan"]
    },
    {"tag": "H",
    "patterns" : ["Kapan harus menunda untuk menyumbangkan darah?"],
    "responses": ["Sedang sakit demam atau influenza tunggu 1 minggu setelah sembuh; \nsetalah cabut gigi, tunggu 5 hari setalah sembuh; \nsetelah operasi kecil, tunggu 6 bulan; \nsetelah operasi besar, \ntunggu 1 tahun; setelah transfusi, tunggu 1 tahun; \nsetelah tato, tindik, tusuk jarum, dan transplantasi tunggu 1 tahun; \nbila kontak erat dengan penderita hepatitis, tunggu 1 tahun; sedang hamil, tunggu 6 setelah melahirkan; \nsedang menyusui, tunggu 3 bulan setelah berhenti menyusui; \nsetelah sakit malaria, tunggu 3 tahun setalah bebas dari gejala malaria; \nsetelah berkunjung dari daerah endemis malaria, tunggu 1 tahun; \nbila tinggal di daerah endemis malaria selama 5 tahun berturut-turut, tunggu 3 tahun setelah keluar dari daerah tersebut; \nbila sakit tipus, tunggu 6 bulan setelah sembuh; \nsetelah vaksin, tunggu 8 minggu; \nada gejala alergi tunggu 1 minggu setalah sembuh; \nada infeksi kulit pada daerah yang akan ditusuk, tunggu 1 minggu setelah sembuh"]
    },
    {"tag": "I",
     "patterns":["Apa donor darah sakit?",
                 "Bagaimana proses mendonorkan darah?",
                 "Apa yang harus saya lakukan selama sesi donor darah?"],
     "responses":["Saat hendak mendonorkan darah, kamu akan berbaring atau duduk di kursi dengan lengan terentang di sandaran tangan. \nManset tekanan darah atau tourniquet akan ditempatkan di sekitar lengan atas. \nTujuannya untuk membuat pembuluh darah lebih mudah terlihat dan mudah untuk memasukkan jarum ke dalamnya. \nPenempatan manset ini juga dapat membantu mengisi kantong darah lebih cepat. \nPetugas akan memasukkan jarum steril baru ke pembuluh darah di lengan. \nPetugas lalu memasang jarum pada tabung plastik tipis dan kantong darah. \nSetelah itu, petugas akan meminta kamu mengepalkan tangan beberapa kali untuk membantu aliran darah dari vena. \nSetelah itu, darah dikumpulkan ke dalam tabung untuk pengujian. \nKemudian darah dibiarkan memenuhi kantong, kira-kira sekitar setengah liter. \nJarum biasanya di tempat sekitar 10 menit."]
     },
    {"tag": "J",
     "patterns":["Seberapa sering saya dapat mendonorkan darah?",
                 "Donor darah berapa bulan sekali?",
                 "Frekuensi donor darah",
                 "Interval donor darah"],
     "responses":["Minimal interval donor darah adalah 2 bulan sekali"]
     },
    {"tag": "K",
     "patterns":["Bye",
                 "Thanks",
                 "Terima kasih",
                 "Saya mengerti",
                 "Terima kasih atas bantuan Anda",
                 "Sangat membantu",
                 "Terima kasih atas layanan Anda",
                 "Sangat terbantu",
                 "Makasi",
                 "Sangat informatif",
                 "Makasih",
                 "Saya paham"],
     "responses":["Sama-sama!",
                  "Senang bisa membantu Anda",
                  "Ada yang bisa dibantu lagi?",
                  "Ya, semoga terbantu",
                  "You're welcome!"]
    },
    {"tag": "L",
     "patterns":["Saya ingin donor",
                 "Saya akan donor"],
     "responses":["Wow, ide yang bagus!! Pastikan Anda telah memenuhi syarat sebelum mendonorkan darah",
                  "Jika Anda telah memenuhi syarat, Anda dapat datang ke UTD terdekat atau event donor darah terdekat"]
     },
    {"tag": "M",
     "patterns":["Jam berapa UTD buka?",
                 "Jam operasional PMI",
                 "Jam operasional UTD",
                 "jam berapa saya harus datang ke UTD?",
                 "jam berapa UTD tutup?"],
     "responses":["Jam operasional tergantung pada daerah Anda. Namun, umumnya UTD akan buka setiap hari jam 07.00 hingga 19.30. Mohon cek kembali UTD terdekat Anda"]
     },
    {"tag": "N",
     "patterns":["Apa persiapan yang harus saya lakukan sebelum donor darah?",
                 "Persiapan sebelum donor darah",
                 "Hal yang harus dilakukan sebelum donor darah"],
     "responses":["Tidurlah yang cukup di malam hari sebelum berencana untuk mendonorkan darah; \nMakan makanan sehat sebelum donasi, hindari makanan berlemak, dan junk food; \nMinum banyak air sebelum proses donor; \nJujurlah pada petugas mengenai obat yang sedang atau baru saja kamu minum. Sebab, beberapa obat sangat mungkin menghalangi proses donor darah terjadi. \nMisalnya, jika kamu adalah pendonor trombosit, kamu tidak boleh minum aspirin selama dua hari sebelum mendonor; \nKenakan kemeja dengan lengan yang bisa digulung."]
     },
    {"tag":  "O",
     "patterns": ["Apa yang harus saya lakukan setelah donor darah?",
                  "Tahap pemulihan donor darah",
                  "Setelah donor harus apa?",
                  "Larangan setelah donor"],
     "responses":["Setelah berdonasi, kamu akan duduk di area observasi untuk beristirahat. \nSetelah donor darah, kamu direkomendasikan untuk: Minum cairan ekstra; \nHindari aktivitas fisik yang berat atau angkat berat selama sekitar lima jam; \nJika merasa pusing, berbaringlah sampai perasaan itu hilang; \nJangan lepaskan perban selama lima jam ke depan; \nJika mengalami pendarahan setelah melepas perban, tekan area tersebut dan angkat lengan hingga pendarahan berhenti; \nJika terjadi memar, oleskan kompres dingin ke area tersebut secara berkala selama 24 jam pertama; \nPertimbangkan untuk menambahkan makanan kaya zat besi ke dalam diet untuk menggantikan zat besi yang hilang setelah donor darah"]
     }
]}